#
# https://github.com/Homebrew/homebrew-bundle
#

tap "derailed/k9s"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

brew "ansible"             # automation tool
brew "autojump".           # quick navigation
brew "bash"                # recent version of bash
brew "bash-completion@2"   # the right completion package
brew "coreutils"           # lots of gnu tools
brew "dos2unix"            # remove bad windows characters
brew "fortune"             # quotes
brew "fzf"                 # fuzzy completion
brew "git"                 # decent version of git
brew "git-extras"          # nice git utilities
brew "git-lfs"             # large file storage for git
brew "gnu-getopt"          # GNU getopt
brew "gnu-sed"             # GNU sed
brew "gnupg"               # GNU PGP
brew "go"                  # Golang compiler
brew "grep"                # GNU grep
brew "helm"                # k8s manifest templating
brew "htop"                # top with colors
brew "ipcalc"              # display CIDR ranges
brew "iproute2mac"         # use iproute2 on a mac
brew "jq"                  # JSON manipulator
brew "kakoune"             # vim style editor
brew "python-yq"           # like jq for YAML
brew "derailed/k9s/k9s"    # k8s dashboard
brew "kubectx"             # change k8s context
brew "kubens"              # change k8s namespaces
brew "kubernetes-cli"      # installs kubectl
brew "kubernetes-helm"     # installs helm3
brew "links"               # CLI web browser
brew "make"                # GNU make
brew "minikube"            # local k8s cluster
brew "ncdu"                # disk dashboard and management
brew "netcat"              # GNU netcat
brew "openssl"             # decent version of openssl
brew "pass"                # password store
brew "python"              # python3
brew "python-yq"           # YAML Query, like jq
brew "readline"            # GNU readline
brew "socat"               # socket plumber
brew "sqlite"              # light database
brew "terraform"           # infra-as-code tool
brew "the_silver_searcher" # ag is a faster grep
brew "tig"                 # TUI for git
brew "tldr"                # Bite size user manuals
brew "tmux"                # terminal multiplexer
brew "tree"                # ls in tree form
brew "vault"               # secret manager
brew "vim"                 # CLI text editing
brew "watch"               # execute a program periodically
brew "wget"                # happy downloads

cask "alfred"              # productivity app
cask "docker"              # containerisation 
cask "sublime-text"        # fast GUI code editor
cask "iterm2"              # nicer terminal

mas "1Password"            # mac alternative password store
mas "Just Focus"           # pomodoro timer
